leetcode_1597_build_binary_expression_tree_from_infix_expression.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 1597. Build Binary Expression Tree From Infix Expression</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Leetcode: 1597. Build Binary Expression Tree From Infix Expression</h1>
<ul class="org-ul">
<li><a href="can_you_break_down_the_problem_in_small_and_easily_to_solve_parts.html#ID-69D68202-BF1A-4D72-A0EC-DDCBAF112500">Can we break-down the problem in small and easily to solve parts?</a>  Convert the expression from infix to posfix and then generate the binary expression tree using the posfix form.  Time and space complexity are \(O(n)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Definition for a binary tree node.</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">class Node(object):</span>
<span style="font-weight: bold; font-style: italic;">#     </span><span style="font-weight: bold; font-style: italic;">def __init__(self, val=" ", left=None, right=None):</span>
<span style="font-weight: bold; font-style: italic;">#         </span><span style="font-weight: bold; font-style: italic;">self.val = val</span>
<span style="font-weight: bold; font-style: italic;">#         </span><span style="font-weight: bold; font-style: italic;">self.left = left</span>
<span style="font-weight: bold; font-style: italic;">#         </span><span style="font-weight: bold; font-style: italic;">self.right = right</span>
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">expTree</span>(<span style="font-weight: bold;">self</span>, s: <span style="font-weight: bold;">str</span>) -&gt; <span style="font-style: italic;">"Node"</span>:
        <span style="font-weight: bold; font-style: italic;">s</span> = <span style="font-style: italic;">"("</span> + s + <span style="font-style: italic;">")"</span>
        <span style="font-weight: bold; font-style: italic;">precedence</span> = {<span style="font-style: italic;">"+"</span>: 1, <span style="font-style: italic;">"-"</span>: 1, <span style="font-style: italic;">"*"</span>: 2, <span style="font-style: italic;">"/"</span>: 2}
        <span style="font-weight: bold; font-style: italic;">posfix</span> = []
        <span style="font-weight: bold; font-style: italic;">st</span> = []
        <span style="font-weight: bold;">for</span> c <span style="font-weight: bold;">in</span> s:
            <span style="font-weight: bold;">if</span> c.isdigit():
                posfix.append(c)
            <span style="font-weight: bold;">elif</span> c == <span style="font-style: italic;">"("</span>:
                st.append(c)
            <span style="font-weight: bold;">elif</span> c == <span style="font-style: italic;">")"</span>:
                <span style="font-weight: bold;">while</span> st <span style="font-weight: bold;">and</span> st[-1] != <span style="font-style: italic;">"("</span>:
                    posfix.append(st.pop())
                st.pop()
            <span style="font-weight: bold;">else</span>:
                <span style="font-weight: bold;">while</span> st <span style="font-weight: bold;">and</span> st[-1] != <span style="font-style: italic;">"("</span> <span style="font-weight: bold;">and</span> precedence[c] &lt;= precedence[st[-1]]:
                    posfix.append(st.pop())
                st.append(c)
        ans = []
        <span style="font-weight: bold;">for</span> c <span style="font-weight: bold;">in</span> posfix:
            <span style="font-weight: bold;">if</span> c.isdigit():
                ans.append(Node(c))
            <span style="font-weight: bold;">else</span>:
                right = ans.pop()
                left = ans.pop()
                ans.append(Node(c, left, right))
        <span style="font-weight: bold;">return</span> ans[0]
</pre>
</div>
</div>
</body>
</html>